Azure/src/DataProcessors/ПолучитьФайл/ПолучитьФайл.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПолучитьФайл</name>
  <attributes>
    <name>СтрокаПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShareName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DirectoryPath</name>
    <comment>Путь по которому будет создан файл (напр. files\)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FileName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверитьMD5</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Azure/src/DataProcessors/ПолучитьФайл/Forms/Форма/Module.bsl
#Область ОбработкаСобытийФормы
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.МножественныйВыбор = Ложь;
	
	ОП = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект); 
	
	Диалог.Показать(ОП);
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДопНастройки) Экспорт
	Если ВыбранныеФайлы <> Неопределено Тогда
		Объект.ПутьКФайлу = ВыбранныеФайлы[0];
	КонецЕсли; 			
КонецПроцедуры


#Область ОбработкаКомандФормы
&НаСервере
Функция ПолучитьФайлНаСервере()

	СтатусОтвет = AzureВызовСервера.ПолучитьФайлAzureFile(
		Объект.СтрокаПодключения,
		Объект.FileName,
		Объект.ShareName,
		Объект.DirectoryPath,
		Объект.ПроверитьMD5);
		
	Возврат СтатусОтвет;
КонецФункции

&НаКлиенте
Процедура ПолучитьФайлКлиент(Команда)
	СтатусОтвет = ПолучитьФайлНаСервере();
	ВспомогательныйКлиент.ВывестиСтатус(СтатусОтвет);
	
	Если НЕ СтатусОтвет.Отказ Тогда
		ДвДанныеПолученныйФайл = СтатусОтвет.Ответ.Тело;
		ДвДанныеПолученныйФайл.Записать(Объект.ПутьКФайлу);
	КонецЕсли; 
КонецПроцедуры
#КонецОбласти 

#КонецОбласти
